[
    {
        "company": "Publicis Sapient",
        "image": "/publicis-sapient.png",
        "jobTitle": "Senior Consultant Developer",
        "dates": "Feb 2019 - current",
        "companyDesc": "Publicis Sapient is a digital transformation partner helping established organizations get to their future, digitally-enabled state, both in the way they work and the way they serve their customers. Partners include Lloyds Bank plc, Unilever, Nationwide Bank and Walt Disney.",
        "actions": [
            {
               
                "text": " Joined Publicis Sapient as a Full stack developer. Was immediately contracted to Lloyds banking group to assist the company in digitising its business user’s journey."
            },
            {
              
                "text": "Joined the team as the only developer that knows UI development.                Helped with design discussion and training other developers. Helped  modularised their apps, created shared libraries and CI/CD pipelines for UI applications."
                      },
            {
                "text": " Developed API endpoints for the backend service using NodeJs,        Loopback I/O and Jest. Contributed to moving their backend services             to containers using Docker and Kubernetes."
            },
            {
                "text": "Involved in Client meetings, gathering requirements, determining             OKRs and breaking business epics into stories."
            },
            {
                "text": " Worked in a team of 4/5 developers, employing an agile approach via    Scrum and Kanban framework. Also participated in fine-tuning            business requirements, client presentation and brown bag sessions"
            }
        ]
    },
    {
        "company": "Perfect Channel",
        "image": "/perfect-channel.png",
        "jobTitle": "Senior Developer",
        "dates": "Aug 2017 - Feb 2019",
        "companyDesc": "Perfect Channel are experts in creating intelligent, enterprise-level auction and trading technologies. Customers include Christie's, Lloyds of London, TMX Group (Agriclear) and Fonterra (Global Diary Trade).",
                "actions": [
            {
               
                "text": "Part of POC/Labs team, responsible for creating new architectures and solutions based on client requirements and future expectations."
            },
            {
              
                "text": "Involved in the refactoring of the company's existing monolith product into a microservice architecture hosted on AWS cloud services."
                      },
            {
                "text": "Created microservices using a serverless architecture. Technologies used include AWS Lambda, Node.js, .NET Core, MySQL, DynamoDB and Elasticsearch."
            },
            {
                "text": "Involved in the company’s adoption of React and TypeScript as their primary UI technology."
            },
            {
                "text": "Team of 4 developers that employ an agile approach using the Scrum framework. This includes code reviews and continuous deployment."
            }
        ]
    },
    {
        "company": "Totaljobs Group",
        "image": "/totaljobs.png",
        "jobTitle": "Software Developer",
        "dates": "Jan 2017 - June 2017",
        "companyDesc": "Totaljobs.com is one of the UK's leading jobs boards, attracting around 6 million jobseekers every month on the hunt for one of 110,000 live job ads the site carries at any one time",
        "actions": [
            {
               
                "text": "Worked as part of the team that deals with SEO and Search aspect of the TotalJobs sites."
            },
            {
              
                "text": "Programmed in C#, AngularJs, Python, LESS and HTML."
            },
            {
                "text": "Helped with the integration of external APIs suck Google Adwords, Lucence Search and Stepstone Data Repo."
            },
            {
                "text": "Gained knowledge of SEO and Advertising campaign"
            },
            {
                "text": "Extensively use practices such pair programming, code review, white-boarding session to collaborate with team members and discuss ideas."
            }
        ]
    },
    {
        "company": "Ticketmaster (LiveNation) -.Net Developer",
        "image": "/livenation.png",
        "jobTitle": "Software Developer",
        "dates": "April 2016 - Dec 2016",
        "companyDesc": "Live Nation Entertainment is an American global entertainment company, founded in 2010, following the merger of Live Nation and Ticketmaster. The company promotes, operates, and manages ticket sales for live entertainment in the United States and internationally. It also owns and operates entertainment venues, and manages the careers of music artists.",
        "actions": [
            {               
                "text": "Joined Livenation tech team with Ticketmaster in April 2016. Was part of the team that researched and developed the company’s first content driven site using Umbraco,Bootstrap, LESS"
            },
            {
              
                "text": "Was part of the team that developed and released the company’s first REST API using .NET Core."
            },
            {
                "text": "Use practices such pair programming, TDD, BDD, continuous integration to develop high quality maintainable code."
            },
            {
                "text": "Participated in the DevOps movement by helping with the integration of teamcity, octopus, SonarQube, AWS deployment."
            },
            {
                "text": "Participated in requirement gathering, stories grooming, prototyping and deployments."
            }
        ]
    }
]